zym787/stm32-platform-refactor/03_Firmware/00_Bootloader/Middlewares/Ymodem/src/ymodem.c
/**
 ******************************************************************************
 * @file    IAP/src/ymodem.c
 * @author  MCD Application Team
 * @version V3.3.0
 * @date    10/15/2010
 * @brief   This file provides all the software functions related to the ymodem
 *          protocol.
 ******************************************************************************
 * @copy
 *
 * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
 * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2010 STMicroelectronics</center></h2>
 */

/** @addtogroup IAP
 * @{
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_flash.h"

#include "flash.h"

#include "common.h"
#include "bootmanager.h"
#include "w25qxx_Handler.h"

#include "Debug.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
uint8_t        file_name[FILE_NAME_LENGTH];
uint32_t       FlashDestination = BackAppAddress;
uint32_t       PageSize         = INTER_PAGE_SIZE;
uint32_t       EraseCounter     = 0x0;
uint32_t       NbrOfPage        = 0;
FLASH_Status   FLASHStatus      = FLASH_COMPLETE;
uint32_t       RamSource;
extern uint8_t tab_1024[1024];

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/**
* @brief Busy-wait poll the UART RX FIFO for one byte.
*
* @param[in]  timeout : max iterations to poll before giving up. NOT a real
*                       time budget: the unit is "one FIFO probe", so wall
*                       time scales with CPU clock and compiler -O level.
*
* @param[out] c       : on success, *c holds the received byte; undefined
*                       on timeout.
*
* @return  0  one byte received
*         -1  timeout (no byte within `timeout` polls)
* */
static int32_t Receive_Byte(uint8_t *c, uint32_t timeout)
{
    /**
    * Bootloader has no SysTick callback / no OSAL — busy-wait is the only
    * cheap blocking primitive available before the OS is up.
    **/
    while (timeout-- > 0)
    {
        if (SerialKeyPressed(c) == 1)
        {
            return 0;
        }
    }
    return -1;
}

/**
 * @brief  Send a byte
 * @param  c: Character
 * @retval 0: Byte sent
 */
static uint32_t Send_Byte(uint8_t c)
{
    SerialPutChar(c);
    return 0;
}

/**
* @brief Receive one Ymodem frame and classify it.
*
* @param[in]  timeout : per-byte busy-wait budget (see Receive_Byte).
*
* @param[out] data    : caller-supplied buffer, must be at least
*                       PACKET_1K_SIZE + PACKET_OVERHEAD (= 1029) bytes.
* @param[out] length  :  0  EOT (end of transmission)
*                       -1  remote abort (CA CA)
*                       >0  payload length (128 or 1024)
*
* @return Ymodem_PacketStatus_t
*           YMODEM_PKT_SUCCESS  caller should inspect *length
*           YMODEM_PKT_TIMEOUT  timeout, framing error, or bad SEQ/~SEQ
*           YMODEM_PKT_ABORT    sender pressed 'A'/'a' to abort
*
* @note Both the SEQ/~SEQ complement byte and the 16-bit XMODEM-CRC
*       trailer are validated. Cal_CRC16() is invoked over the payload
*       after the SEQ check; mismatches return YMODEM_PKT_TIMEOUT, which
*       the outer loop converts into a NAK that asks the sender to
*       retransmit the offending frame.
* */
static int32_t Receive_Packet(uint8_t *data, int32_t *length, uint32_t timeout)
{
    uint16_t i, packet_size;
    uint8_t  c;
    *length = 0;
    if (Receive_Byte(&c, timeout) != 0)
    {
        return (int32_t)YMODEM_PKT_TIMEOUT;
    }

    /**
    * First byte selects the framing: SOH/STX = data packet (128/1024 B),
    * EOT = clean end, CA CA = sender abort, 'A'/'a' = user abort, anything
    * else = treat as line noise and ask sender to retry via NAK/'C' upstream.
    **/
    switch (c)
    {
    case SOH:
        packet_size = PACKET_SIZE;
        break;
    case STX:
        packet_size = PACKET_1K_SIZE;
        break;
    case EOT:
        return (int32_t)YMODEM_PKT_SUCCESS;
    case CA:
        /**
        * Ymodem requires two consecutive CA to mean "remote abort". A lone
        * CA is ambiguous, so we wait for the second one within the same
        * byte-timeout; if it doesn't arrive, treat as garbage line noise.
        **/
        if ((Receive_Byte(&c, timeout) == 0) && (c == CA))
        {
            *length = -1;
            return (int32_t)YMODEM_PKT_SUCCESS;
        }
        else
        {
            return (int32_t)YMODEM_PKT_TIMEOUT;
        }
    case ABORT1:
    case ABORT2:
        return (int32_t)YMODEM_PKT_ABORT;
    default:
        return (int32_t)YMODEM_PKT_TIMEOUT;
    }

    /**
    * Drain the remainder of the frame: 2 B seq header + payload + 2 B CRC.
    * data[0] already holds the framing byte (SOH/STX) from the switch above.
    **/
    *data = c;
    for (i = 1; i < (packet_size + PACKET_OVERHEAD); i++)
    {
        if (Receive_Byte(data + i, timeout) != 0)
        {
            return (int32_t)YMODEM_PKT_TIMEOUT;
        }
    }

    /* SEQ / ~SEQ complement check. */
    if (data[PACKET_SEQNO_INDEX] !=
        ((data[PACKET_SEQNO_COMP_INDEX] ^ 0xff) & 0xff))
    {
        return (int32_t)YMODEM_PKT_TIMEOUT;
    }

    /* CRC-16/XMODEM check. Sender places the CRC over the 128/1024 B
       payload (MSB first, LSB second) in the two trailer bytes right after
       the data. Cal_CRC16 is the existing implementation at the bottom of
       this file — it was defined but never called by the receive path,
       letting corrupted payloads with intact SEQ/~SEQ slip through. */
    {
        const uint16_t expected_crc =
            Cal_CRC16(&data[PACKET_HEADER], (uint32_t)packet_size);
        const uint16_t received_crc =
            ((uint16_t)data[PACKET_HEADER + packet_size] << 8) |
             (uint16_t)data[PACKET_HEADER + packet_size + 1];
        if (expected_crc != received_crc)
        {
            DEBUG_OUT(w, YMODEM_PACKET_LOG_TAG,
                      "CRC mismatch seq=%u got=0x%04X expected=0x%04X",
                      (unsigned)(data[PACKET_SEQNO_INDEX] & 0xFFu),
                      (unsigned)received_crc, (unsigned)expected_crc);
            return (int32_t)YMODEM_PKT_TIMEOUT;
        }
    }

    *length = packet_size;
    return (int32_t)YMODEM_PKT_SUCCESS;
}

/* Private state machine handler functions ---------------------------------*/

/**
* @brief FSM handler for the Ymodem "block 0" filename packet.
*
* Parses the NUL-terminated filename + space-separated ASCII size pair from
* the packet payload, sizes the upcoming transfer, erases the staging block
* in external flash, and transitions the FSM into the data-receive state.
* An empty payload (data[PACKET_HEADER] == 0) signals "no more files" and
* ends the session.
*
* @param[in,out] ctx : transfer context; on success ctx->size and
*                      ctx->state are updated, file_name[] is populated.
*
* @return YMODEM_RX_HANDLER_CONTINUE  filename parsed, expect data packets
*         YMODEM_RX_HANDLER_DONE      empty filename → end of session
*         YMODEM_RX_HANDLER_ERROR     size exceeds Flash budget (CA CA sent)
*
* @note The filename/size copy loops below can overrun file_name[] and
*       ctx->file_size[] by one byte if the sender sends a filename of
*       exactly FILE_NAME_LENGTH (256) without a NUL terminator, or a size
*       field of FILE_SIZE_LENGTH (16) without a trailing space. Trusted
*       transmitter only — do not expose this path to untrusted peers
*       without bounding the trailing terminator write.
* */
static int32_t Ymodem_RxState_FileInfo(Ymodem_RxContext_t *ctx)
{
    /**
    * Block 0 payload layout (Ymodem):
    *   [filename\0][ascii size " "][padding 0x00...].
    * A leading 0x00 byte means "session over" (sender sends one such packet
    * after the final EOT to gracefully close the session).
    **/
    if (ctx->packet_data[PACKET_HEADER] != 0)
    {
        /* Filename packet has valid data */
        for (ctx->i = 0, ctx->file_ptr = ctx->packet_data + PACKET_HEADER;
             (*ctx->file_ptr != 0) && (ctx->i < FILE_NAME_LENGTH);)
        {
            file_name[ctx->i++] = *ctx->file_ptr++;
        }
        file_name[ctx->i++] = '\0';
        for (ctx->i = 0, ctx->file_ptr++;
             (*ctx->file_ptr != ' ') && (ctx->i < FILE_SIZE_LENGTH);)
        {
            ctx->file_size[ctx->i++] = *ctx->file_ptr++;
        }
        ctx->file_size[ctx->i++] = '\0';
        Str2Int(ctx->file_size, &ctx->size);

