zym787/stm32-platform-refactor/03_Firmware/00_Bootloader/Middlewares/Ymodem/src/ymodem.c
        /* Debug: Print received file size */
        DEBUG_OUT(d, YMODEM_FILE_INFO_LOG_TAG, "File size: %d bytes", ctx->size);

        /**
        * Compare declared image size against the internal-flash APP slot
        * budget — even though the staging area is the external W25Q64, the
        * image will eventually be copied back into internal flash by the
        * APP-side OTA flow, so the upstream limit still applies here.
        **/
        if (ctx->size > (INTER_FLASH_SIZE - 1))
        {
            DEBUG_OUT(e, YMODEM_FILE_INFO_LOG_TAG, "File size exceeds Flash!");
            /**
            * Two consecutive CA bytes is the Ymodem "abort transfer" signal
            * the sender is required to honour.
            **/
            Send_Byte(CA);
            Send_Byte(CA);
            return (int32_t)YMODEM_RX_HANDLER_ERROR;
        }

        /* Erase Flash sectors for application storage */
        // elog_info("FileInfo",
        //           "Erasing Backup Flash: addr=0x%08x, size=%d bytes",
        //           BackAppAddress, ctx->size);
        // uint8_t erase_result = Flash_erase(BackAppAddress, ctx->size);
        // if (erase_result != 0)
        // {
        //     elog_error("FileInfo", "Flash erase failed!");
        //     Send_Byte(CA);
        //     Send_Byte(CA);
        //     return (int32_t)YMODEM_RX_HANDLER_ERROR;
        // }
        // elog_info("FileInfo", "Flash erase success");

        /**
        * Pre-erase the staging block in external SPI NOR before streaming
        * payload into it. W25Q64 sector erase is the slow step (~50 ms per
        * 4 KB sector), doing it once here keeps the data-packet path fast.
        **/
        Erase_Flash_Block(BLOCK_1);

        /**
        * ACK + 'C' tells the sender "filename received, please start data,
        * use 16-bit CRC mode". Sender will then transmit block 1.
        **/
        Send_Byte(ACK);
        Send_Byte(CRC16);
        DEBUG_OUT(d, YMODEM_FILE_INFO_LOG_TAG, "Transition to FILE_DATA state");
        ctx->bytes_received = 0; /* Reset byte counter for new file */
        ctx->state          = YMODEM_RX_STATE_FILE_DATA;
        return (int32_t)YMODEM_RX_HANDLER_CONTINUE;
    }
    /**
    * Empty filename packet — Ymodem's graceful end-of-session marker. Just
    * ACK and let the outer loop tear down.
    **/
    else
    {
        Send_Byte(ACK);
        DEBUG_OUT(i, YMODEM_LOG_TAG, "Session complete, file transfer successful");
        ctx->file_done    = 1;
        ctx->session_done = 1;
        return (int32_t)YMODEM_RX_HANDLER_DONE;
    }
}

/**
* @brief FSM handler for Ymodem data packets — stream payload into the
*        W25Q64 staging block and ACK back.
*
* @param[in,out] ctx : transfer context; ctx->bytes_received is advanced.
*
* @return YMODEM_RX_HANDLER_CONTINUE  packet written (or ignored), ACK sent
*         YMODEM_RX_HANDLER_ERROR     W25Q64 write failed (CA CA sent)
*
* @note bytes_to_copy is clamped against the declared file size to drop the
*       0x1A / 0x00 padding the sender stuffs into the last packet — without
*       this, the staged image would contain trailing junk and verify would
*       fail downstream. Bytes_to_copy can theoretically reach 0 or negative
*       if the sender lies about ctx->size; caller currently relies on
*       W25Q64_WriteData() rejecting bogus lengths. Caveat emptor.
* */
static int32_t Ymodem_RxState_FileData(Ymodem_RxContext_t *ctx)
{
    /**
    * Skip control packets (length 0 = EOT, length -1 = remote abort). Those
    * are handled by the outer FSM; here we only consume real data frames.
    **/
    if (ctx->packet_length > 0)
    {
        /**
        * Last data packet is padded to a full 128/1024 B frame with 0x1A or
        * 0x00. Trim to the declared file size so the staged image is byte-
        * exact — important for the post-flash CRC check on the APP side.
        **/
        int32_t bytes_to_copy = ctx->packet_length;
        if ((ctx->bytes_received + bytes_to_copy) > ctx->size)
        {
            bytes_to_copy = ctx->size - ctx->bytes_received;
        }

        /**
        * Payload starts at PACKET_HEADER (skip SOH/STX + 2-byte SEQ header).
        * W25Q64_WriteData buffers writes internally to amortize page-program
        * cost; the matching _End() flush is invoked in Ymodem_Receive.
        **/
        uint8_t *src_ptr = ctx->packet_data + PACKET_HEADER;

        if (W25Q64_WriteData(BLOCK_1, src_ptr, bytes_to_copy) != 0)
        {
            DEBUG_OUT(e, YMODEM_FILE_DATA_LOG_TAG,
                      "External flash write failed at offset=%d, len=%d",
                      ctx->bytes_received, bytes_to_copy);
            Send_Byte(CA);
            Send_Byte(CA);
            return (int32_t)YMODEM_RX_HANDLER_ERROR;
        }

        // uint32_t flash_addr = FlashDestination;

        // elog_debug("FileData", "Programming Flash: offset=%d/%d (%d bytes)",
        //            ctx->bytes_received, ctx->size, bytes_to_copy);

        // // Write data in 32-bit word chunks
        // for (int32_t i = 0; i < bytes_to_copy; i += 4)
        // {
        //     // Get 32-bit word from packet (handle last partial word)
        //     uint32_t word_data  = 0xFFFFFFFF;
        //     int32_t  bytes_left = bytes_to_copy - i;

        //     if (bytes_left >= 4)
        //     {
        //         word_data = *(uint32_t *)src_ptr;
        //         src_ptr += 4;
        //     }
        //     else
        //     {
        //         // Handle last partial word (1-3 bytes)
        //         for (int32_t j = 0; j < bytes_left; j++)
        //         {
        //             word_data &= ~(0xFF << (j * 8));
        //             word_data |= (*src_ptr++ << (j * 8));
        //         }
        //     }

        //     // Program the word to Flash
        //     Flash_Write(flash_addr, word_data);

        //     // Verify the write (critical check!)
        //     if (*(uint32_t *)(flash_addr) != word_data)
        //     {
        //         elog_error("FileData",
        //                    "Flash write verification failed at 0x%08x",
        //                    flash_addr);
        //         Send_Byte(CA);
        //         Send_Byte(CA);
        //         return (int32_t)YMODEM_RX_HANDLER_ERROR;
        //     }

        //     flash_addr += 4;
        // }

